tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-fonts"

# CLI tools
brew "bat"
brew "clang-format"
brew "cocoapods"
brew "diff-so-fancy"
brew "fd"
brew "fish"
brew "fnm"
# brew "fzf"
brew "gh"
# brew "ghc"
brew "git"
# brew "haskell-language-server"
# brew "mas"
brew "neovim"
# brew "node@16"
brew "pastel"
# brew "postgresql"
brew "python@3.10"
brew "ripgrep"
brew "rust-analyzer"
brew "swiftformat"
brew "swiftlint"
brew "tree-sitter"
brew "watchman"

# cask "android-studio"
# cask "discord"
cask "figma"
cask "firefox"
cask "font-jetbrains-mono"
cask "iterm2"
cask "mullvadvpn"
# cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "zulu11"

# MAS apps
# mas "1Password 7", id: 1333542190
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Xcode", id: 497799835
# mas "AdGuard for Safari", id: 1440147259
