tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# tap "AdoptOpenJDK/openjdk"

# CLI tools
brew "bat"
brew "clang-format"
brew "cocoapods"
brew "diff-so-fancy"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "ghc"
brew "git"
brew "haskell-language-server"
brew "mas"
brew "neovim"
brew "pastel"
brew "postgresql"
brew "python@3.9"
brew "ripgrep"
brew "swiftformat"
brew "tldr"
brew "tmux"
brew "tree"
brew "watchman"
brew "yarn"

# cask "adoptopenjdk11" # requires sudo
cask "android-studio"
# cask "discord"
cask "figma"
cask "firefox"
cask "iterm2"
cask "notion"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# MAS apps
mas "1Password 7", id: 1333542190
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "AdGuard for Safari", id: 1440147259
mas "Trello", id: 1278508951
