tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# CLI tools
brew "bat"
brew "clang-format"
brew "cocoapods"
brew "diff-so-fancy"
brew "fish"
brew "git"
brew "git-lfs"
brew "glow"
brew "hub"
brew "mas"
brew "neovim"
brew "node@10"
brew "pastel"
brew "postgresql@9.5"
brew "python"
brew "ripgrep"
brew "swiftformat"
brew "tldr"
brew "tree"
brew "vim"
brew "watchman"
brew "wget"
brew "yarn"

# cask "adoptopenjdk8" # requires sudo
cask "android-studio"
cask "discord"
cask "figma"
cask "firefox"
cask "iterm2"
cask "postman"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

# MAS apps
mas "1Password 7", id: 1333542190
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
